experiment-data/k3s/dp_redis_density-4/dp_redis_density/2022-10-28T09-19-14/kbench-pod-oid-0-tid-0/memtier.out
4         Threads
50        Connections per thread
600       Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets          621.04          ---          ---        29.25549        23.67900       144.38300       234.49500        47.83 
Gets         6208.76         0.33      6208.43        29.20927        23.67900       143.35900       234.49500       241.85 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals       6829.80         0.33      6208.43        29.21348        23.67900       143.35900       234.49500       289.68 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.391        0.000
SET       6.271        5.000
SET       9.791       10.000
SET      12.223       15.000
SET      14.207       20.000
SET      15.871       25.000
SET      17.535       30.000
SET      19.071       35.000
SET      20.479       40.000
SET      22.015       45.000
SET      23.679       50.000
SET      24.575       52.500
SET      25.471       55.000
SET      26.367       57.500
SET      27.263       60.000
SET      28.287       62.500
SET      29.439       65.000
SET      30.591       67.500
SET      31.999       70.000
SET      33.279       72.500
SET      34.815       75.000
SET      35.839       76.250
SET      36.607       77.500
SET      37.631       78.750
SET      38.655       80.000
SET      39.679       81.250
SET      40.703       82.500
SET      41.983       83.750
SET      43.519       85.000
SET      45.055       86.250
SET      46.591       87.500
SET      47.615       88.125
SET      48.639       88.750
SET      49.663       89.375
SET      50.943       90.000
SET      52.223       90.625
SET      53.503       91.250
SET      55.039       91.875
SET      56.831       92.500
SET      58.879       93.125
SET      60.927       93.750
SET      62.207       94.062
SET      63.743       94.375
SET      65.279       94.688
SET      67.071       95.000
SET      69.119       95.312
SET      71.679       95.625
SET      74.239       95.938
SET      77.311       96.250
SET      80.895       96.562
SET      85.503       96.875
SET      88.063       97.031
SET      91.135       97.188
SET      94.207       97.344
SET      97.279       97.500
SET     100.351       97.656
SET     103.935       97.812
SET     108.031       97.969
SET     112.127       98.125
SET     116.735       98.281
SET     121.855       98.438
SET     124.415       98.516
SET     126.975       98.594
SET     130.047       98.672
SET     133.119       98.750
SET     136.191       98.828
SET     140.287       98.906
SET     143.359       98.984
SET     147.455       99.062
SET     151.551       99.141
SET     156.671       99.219
SET     158.719       99.258
SET     160.767       99.297
SET     163.839       99.336
SET     166.911       99.375
SET     169.983       99.414
SET     173.055       99.453
SET     176.127       99.492
SET     179.199       99.531
SET     182.271       99.570
SET     186.367       99.609
SET     188.415       99.629
SET     190.463       99.648
SET     191.487       99.668
SET     194.559       99.688
SET     196.607       99.707
SET     199.679       99.727
SET     201.727       99.746
SET     204.799       99.766
SET     207.871       99.785
SET     209.919       99.805
SET     211.967       99.814
SET     214.015       99.824
SET     216.063       99.834
SET     218.111       99.844
SET     221.183       99.854
SET     223.231       99.863
SET     225.279       99.873
SET     228.351       99.883
SET     231.423       99.893
SET     235.519       99.902
SET     237.567       99.907
SET     239.615       99.912
SET     241.663       99.917
SET     242.687       99.922
SET     245.759       99.927
SET     247.807       99.932
SET     249.855       99.937
SET     251.903       99.941
SET     255.999       99.946
SET     259.071       99.951
SET     260.095       99.954
SET     261.119       99.956
SET     264.191       99.958
SET     266.239       99.961
SET     266.239       99.963
SET     268.287       99.966
SET     270.335       99.968
SET     270.335       99.971
SET     272.383       99.973
SET     276.479       99.976
SET     276.479       99.977
SET     280.575       99.978
SET     280.575       99.979
SET     282.623       99.980
SET     284.671       99.982
SET     286.719       99.983
SET     292.863       99.984
SET     294.911       99.985
SET     296.959       99.987
SET     299.007       99.988
SET     299.007       99.988
SET     299.007       99.989
SET     301.055       99.990
SET     301.055       99.990
SET     303.103       99.991
SET     307.199       99.991
SET     307.199       99.992
SET     311.295       99.993
SET     313.343       99.993
SET     323.583       99.994
SET     325.631       99.994
SET     325.631       99.995
SET     325.631       99.995
SET     325.631       99.995
[...]
SET     327.679       99.996
SET     329.727       99.996
SET     331.775       99.996
SET     331.775       99.997
SET     333.823       99.997
SET     333.823       99.997
SET     333.823       99.997
[...]
SET     333.823       99.998
SET     337.919       99.998
SET     339.967       99.998
SET     339.967       99.998
SET     346.111       99.998
SET     346.111       99.998
SET     350.207       99.998
SET     350.207       99.999
SET     350.207       99.999
SET     350.207       99.999
[...]
SET     370.687       99.999
SET     370.687       99.999
SET     370.687       99.999
[...]
SET     372.735       99.999
SET     372.735       99.999
SET     372.735       99.999
[...]
SET     403.455       99.999
SET     403.455      100.000
SET     403.455      100.000
SET     403.455      100.000
[...]
SET     411.647      100.000
SET     411.647      100.000
---
GET       0.343        0.000
GET       6.271        5.000
GET       9.791       10.000
GET      12.159       15.000
GET      14.143       20.000
GET      15.871       25.000
GET      17.407       30.000
GET      18.943       35.000
GET      20.479       40.000
GET      22.015       45.000
GET      23.679       50.000
GET      24.447       52.500
GET      25.343       55.000
GET      26.239       57.500
GET      27.263       60.000
GET      28.287       62.500
GET      29.311       65.000
GET      30.591       67.500
GET      31.871       70.000
GET      33.279       72.500
GET      34.815       75.000
GET      35.839       76.250
GET      36.607       77.500
GET      37.631       78.750
GET      38.655       80.000
GET      39.679       81.250
GET      40.703       82.500
GET      41.983       83.750
GET      43.519       85.000
GET      45.055       86.250
GET      46.591       87.500
GET      47.615       88.125
GET      48.639       88.750
GET      49.663       89.375
GET      50.687       90.000
GET      51.967       90.625
GET      53.503       91.250
GET      55.039       91.875
GET      56.831       92.500
GET      58.623       93.125
GET      60.927       93.750
GET      62.207       94.062
GET      63.743       94.375
GET      65.279       94.688
GET      67.071       95.000
GET      69.119       95.312
GET      71.679       95.625
GET      74.239       95.938
GET      77.823       96.250
GET      81.407       96.562
GET      86.015       96.875
GET      88.575       97.031
GET      91.135       97.188
GET      94.207       97.344
GET      97.279       97.500
GET     100.863       97.656
GET     103.935       97.812
GET     107.519       97.969
GET     112.127       98.125
GET     116.223       98.281
GET     120.831       98.438
GET     123.391       98.516
GET     125.951       98.594
GET     129.023       98.672
GET     132.095       98.750
GET     135.167       98.828
GET     138.239       98.906
GET     142.335       98.984
GET     146.431       99.062
GET     149.503       99.141
GET     154.623       99.219
GET     156.671       99.258
GET     159.743       99.297
GET     161.791       99.336
GET     164.863       99.375
GET     167.935       99.414
GET     171.007       99.453
GET     174.079       99.492
GET     177.151       99.531
GET     181.247       99.570
GET     184.319       99.609
GET     186.367       99.629
GET     188.415       99.648
GET     190.463       99.668
GET     192.511       99.688
GET     195.583       99.707
GET     198.655       99.727
GET     200.703       99.746
GET     203.775       99.766
GET     206.847       99.785
GET     209.919       99.805
GET     211.967       99.814
GET     214.015       99.824
GET     215.039       99.834
GET     218.111       99.844
GET     220.159       99.854
GET     223.231       99.863
GET     225.279       99.873
GET     228.351       99.883
GET     231.423       99.893
GET     235.519       99.902
GET     236.543       99.907
GET     238.591       99.912
GET     240.639       99.917
GET     242.687       99.922
GET     244.735       99.927
GET     246.783       99.932
GET     249.855       99.937
GET     251.903       99.941
GET     253.951       99.946
GET     255.999       99.951
GET     258.047       99.954
GET     259.071       99.956
GET     260.095       99.958
GET     262.143       99.961
GET     264.191       99.963
GET     266.239       99.966
GET     268.287       99.968
GET     270.335       99.971
GET     272.383       99.973
GET     274.431       99.976
GET     276.479       99.977
GET     278.527       99.978
GET     280.575       99.979
GET     282.623       99.980
GET     282.623       99.982
GET     284.671       99.983
GET     288.767       99.984
GET     292.863       99.985
GET     294.911       99.987
GET     296.959       99.988
GET     299.007       99.988
GET     299.007       99.989
GET     301.055       99.990
GET     305.151       99.990
GET     307.199       99.991
GET     309.247       99.991
GET     311.295       99.992
GET     313.343       99.993
GET     315.391       99.993
GET     319.487       99.994
GET     321.535       99.994
GET     321.535       99.995
GET     323.583       99.995
GET     325.631       99.995
GET     327.679       99.995
GET     329.727       99.996
GET     329.727       99.996
GET     331.775       99.996
GET     333.823       99.997
GET     333.823       99.997
GET     335.871       99.997
GET     335.871       99.997
GET     337.919       99.997
GET     337.919       99.998
GET     339.967       99.998
GET     342.015       99.998
GET     346.111       99.998
GET     346.111       99.998
GET     348.159       99.998
GET     350.207       99.998
GET     350.207       99.999
GET     350.207       99.999
GET     350.207       99.999
GET     352.255       99.999
GET     354.303       99.999
GET     354.303       99.999
GET     354.303       99.999
GET     356.351       99.999
GET     360.447       99.999
GET     374.783       99.999
GET     374.783       99.999
GET     376.831       99.999
GET     376.831       99.999
GET     378.879       99.999
GET     385.023       99.999
GET     385.023       99.999
GET     385.023      100.000
GET     385.023      100.000
GET     387.071      100.000
GET     389.119      100.000
GET     389.119      100.000
GET     389.119      100.000
[...]
GET     403.455      100.000
GET     405.503      100.000
GET     405.503      100.000
GET     405.503      100.000
[...]
GET     411.647      100.000
GET     411.647      100.000
GET     411.647      100.000
[...]
GET     413.695      100.000
GET     413.695      100.000
---
WAIT      0.000      100.000